import User from "./User.tsx";
import {useCallback, useEffect, useMemo, useState} from "react";


const Users = () => {
    //В компоненті Юзерс ми через хуки юзефект і юзестейт беремо і фетчимо дані юзерів з даммі джейсон
    //ця дія викликає рендеринг цієї компоненти а так я ця компонента викликає компоненту Юзер то автоматично ми хочемо цього позбутись оскільки там немає даних які нам потрібно рендерити бо там статичний код
    console.log("users")
    const [users, setUsers] = useState([]);
    //Коли відбувається виклик хука юзестейт він автоматично викликає рендеринг функції Foo
    //Для того щоб уникнути повторного рендеринга цієї функції було використано хук ЮзКолбек який кешує значення всередині функції і передає всього лиш один раз в компонент Юзер
    const foo = useCallback ( () => {
        console.log('test')
    }, [])
    //Коли викликається юзстейт і встановлюється значення в юзерс, то масив який був прорендерений до того при першому виклику, знову перезаписується
    // для того щоб уникнути цього, ми використовуємо юзМемо колбек функцію яка виконується тільки один раз і при наступних рендерах вона не перезаписує значення всередині себе
    // якшо масив який ми передали другим параметром не мінявся
    const arr = useMemo(() => {
        return  [11,22,33]
    }, []);


    useEffect(() => {
        fetch('https://dummyjson.com/users').then(
            value => value.json()
        ).then(value => setUsers(value))
    }, []);
    return (
        <div>
            <User foo={foo} arr={arr}/>
        </div>
    );
};

export default Users;